In [1]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'A':[1, 2, np.nan],
                  'B':[5, np.nan, np.nan],
                  'C':[1, 2, 3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [2]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [3]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [4]:
df.dropna(thresh=3,axis=1)

   C
0  1
1  2
2  3

In [5]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [6]:
import numpy as np
import pandas as pd
V1 = np.array([2,3,5,np.NaN,7,1,np.NaN,10,14])
V2 = np.array([8,np.NaN,5,8,11,np.NaN,np.NaN,2,3])
V3 = np.array([np.NaN,13,5,6,13,7,np.NaN,3,30])
df = pd.DataFrame(
        {"Var1" : V1,
         "Var2" : V2,
         "Var3" : V3}        
)

df

   Var1  Var2  Var3
0   2.0   8.0   NaN
1   3.0   NaN  13.0
2   5.0   5.0   5.0
3   NaN   8.0   6.0
4   7.0  11.0  13.0
5   1.0   NaN   7.0
6   NaN   NaN   NaN
7  10.0   2.0   3.0
8  14.0   3.0  30.0

In [7]:
df.isnull().sum()

Var1    2
Var2    3
Var3    2
dtype: int64

In [8]:
len(df)

9

In [9]:
df.isnull().sum()/len(df)

Var1    0.222222
Var2    0.333333
Var3    0.222222
dtype: float64

In [10]:
df.notnull().sum()

Var1    7
Var2    6
Var3    7
dtype: int64

In [11]:
df.isnull()

    Var1   Var2   Var3
0  False  False   True
1  False   True  False
2  False  False  False
3   True  False  False
4  False  False  False
5  False   True  False
6   True   True   True
7  False  False  False
8  False  False  False